# Тема: Елементи програм (Введення / Перетворення / Виведення)
# ---------------------------------------------------------------
# Будь-яка програма складається з трьох елементів:
# 1. Введення (отримання даних)
# 2. Перетворення (обробка даних)
# 3. Виведення (виведення результату)

# Введення (отримання даних)
age = input("Введіть ваш вік: ")

# Перетворення (обробка даних)
hello = f"Ваш вік, {age}!"

is_adult = int(age) >= 18
# Виведення (виведення даних)
print(is_adult)

# Приклад роботи:
# Введіть ваше ім'я: Валерія
# Привіт, Валерія!
